var status = -1;

var s = -1;

function start() {
	status = -1;
	s = -1;
	action(1, 0, 0);
}

function action(mode, type, selection) {
	if (mode == 0 && selection == -1) {
		cm.dispose();
		return;
	}
	if (mode == -1) {
		cm.dispose();
		return;
	}
	if (mode == 0) {
		status--;
	}
	if (mode == 1) {
		status++;
	}

	if (status == 0) {
		cm.sendSimple("คุณอยากรู้เกี่ยวกับ #bMaple Union#k ใช่ไหม?\r\nต้องการให้อธิบายเรื่องอะไรดี?\r\n#L0# #bMaple Union คืออะไร?#k#l\r\n#L1# #bระดับ Union#k#l\r\n#L2# #bอันดับ Union#k#l\r\n#L3# #bกองกำลังและพลังรบ#k#l\r\n#L4# #bแผนที่การรบและบล็อกตัวละคร#k#l\r\n#L9# #bฟังก์ชันบันทึก Preset#k#l\r\n#L5# #bUnion Raid#k#l\r\n\r\n#L100# #eหยุดฟังคำอธิบาย#n#l");
	} else if (status == 1) {
		if (s == -1) {
			s = selection;
		}

		if (s == 0) {
			cm.sendNext("#e<Maple Union คืออะไร?>#n\r\n\r\n#eMaple Union#n หมายถึง #bกลุ่มตัวละครในเวิลด์เดียวกัน#k\r\nแต่ไม่ใช่ว่าตัวละครทั้งหมดจะสามารถเข้า #bMaple Union#k ได้\r\n#rต้องเป็นตัวละครที่เลเวล 60 ขึ้นไป/เปลี่ยนอาชีพครั้งที่ 2 แล้ว#k\r\nและถ้า #rมีตัวละครมากกว่า 40 ตัวในเวิลด์เดียวกัน#k จะนับเฉพาะ #bอันดับ 40 อันดับแรกตามเลเวล#k เท่านั้นที่จะได้รับการยอมรับเป็นสมาชิก Maple Union\r\n\r\nนอกจากนี้สำหรับ #bZero#k จะนับเฉพาะ #rตัวละครที่มีเลเวลสูงสุดที่เลเวล 130 ขึ้นไป 1 ตัว#k เท่านั้นที่จะได้รับการยอมรับเป็นสมาชิก Maple Union");
		} else if (s == 1) {
			cm.sendNext("#e<ระดับ Union>#n\r\n\r\n#eระดับ Union#n หมายถึง #bผลรวมของเลเวล#k ของตัวละครทั้งหมดที่อยู่ใน #bMaple Union#k\r\n\r\nระดับ Union ที่สูงจะทำให้สามารถ #rเลื่อนขั้น#k ไปสู่ #bอันดับ Union#k ที่สูงขึ้นได้ และสามารถสร้าง Maple Union ที่แข็งแกร่งยิ่งขึ้น\r\n\r\n#bการจัดอันดับระดับ Union#k สามารถตรวจสอบได้ที่หน้าเว็บไซต์");
		} else if (s == 2) {
			cm.sendSimple("#e<อันดับ Union>#n\r\n\r\n#eอันดับ Union#n คือ #bเกณฑ์การเติบโต#k ที่สามารถเพิ่มได้เมื่อ #bระดับ Union#k ถึงค่าที่กำหนด\r\n\r\n#bอันดับ Union#k ที่สูงจะทำให้สามารถวาง #rสมาชิกกองกำลังได้มากขึ้น#k ใน #rแผนที่การรบที่กว้างขึ้น#k\r\nเมื่อ #bระดับ Union#k ถึงระดับหนึ่งและต้องการ #bเลื่อนขั้น#k จะต้องจ่าย #b#i4310229:##t4310229##k\r\n\r\n#L1# #bดูเลเวลที่ต้องการ/เหรียญที่ต้องจ่าย/จำนวนสมาชิกกองกำลัง แต่ละอันดับ#k#l");
		} else if (s == 3) {
			cm.sendNext("#e<กองกำลังและพลังรบ>#n\r\n\r\n#bกองกำลัง#k หมายถึง #bกลุ่มตัวละครที่ถูกวางบนแผนที่การรบ#k จากตัวละคร Union\r\n\r\n#bสมาชิกกองกำลัง#k จะเข้าร่วม #rUnion Raid#k เพื่อต่อสู้กับศัตรูที่แข็งแกร่งและรวบรวม #bเหรียญ Union#k\r\n\r\nนอกจากนี้สมาชิกกองกำลังจะเปิดใช้งาน #b<เอฟเฟกต์สมาชิกกองกำลัง>#k เฉพาะของตัวละคร และ #b<เอฟเฟกต์การยึดครองของกองกำลัง>#k ตามสถานะการยึดครองแผนที่การรบ เพื่อมอบ #bเอฟเฟกต์เพิ่มความสามารถ#k ให้กับ #rตัวละครทั้งหมดในเวิลด์#k");
		} else if (s == 4) {
			cm.sendNext("#e<แผนที่การรบและบล็อกตัวละคร>#n\r\n\r\n#bแผนที่การรบ#k คือแผนที่ที่สามารถวาง #rสมาชิกกองกำลัง#k เพื่อยึดครอง ประกอบด้วย #bภายใน 8 พื้นที่#k, #rภายนอก 8 พื้นที่#k #eรวม 16 พื้นที่#n\r\nแต่ละพื้นที่มี #bความสามารถเฉพาะ#k และความสามารถจะเพิ่มขึ้นตาม #rจำนวนช่องที่ยึดครอง#k ในแต่ละพื้นที่\r\n\r\n#bความสามารถของภายใน 8 พื้นที่#k สามารถ #bเปลี่ยนแปลงได้ตามต้องการ#k\r\n#rความสามารถของภายนอก 8 พื้นที่#k เป็นค่าคงที่");
		} else if (s == 5) {
			cm.sendNext("#e<Union Raid>#n\r\n\r\n#bUnion Raid#k คือ #rคอนเทนต์การต่อสู้#k ที่ดำเนินการโดย #bสมาชิกกองกำลัง#k\r\n\r\nสามารถเข้าได้โดยกดปุ่ม #e<เข้าร่วมการต่อสู้>#n ใน Union UI ด้วยตัวละครที่อยู่ในกองกำลัง\r\nเมื่อเข้า Raid #bสมาชิกกองกำลัง#k จะกำลังต่อสู้อย่างหนัก");
		} else if (s == 6) {
			cm.sendNext("#e<การจัดอันดับเหรียญที่ได้รับรายสัปดาห์>#n\r\n\r\n#bการจัดอันดับเหรียญที่ได้รับรายสัปดาห์#k จะคำนวณอันดับตามจำนวน #bเหรียญ Union#k ที่ตัวละครทั้งหมดในเวิลด์ได้รับ\r\n#bตั้งแต่วันจันทร์เวลา 00:30 น.#k #rถึงวันอาทิตย์เวลา 23:30 น.#k ของทุกสัปดาห์");
		} else if (s == 9) {
			cm.sendNext("#e<ฟังก์ชันบันทึก Preset>#n\r\n\r\nต้องการเปลี่ยน #rบล็อกตัวละครและความสามารถภายใน 8 ตัว#k ที่วางบน #bแผนที่การรบ#k ให้เหมาะกับแต่ละสถานการณ์ใช่ไหม?\r\nถ้าอย่างนั้นลองใช้ฟังก์ชัน #bUnion Preset#k สิ!");
		} else if (s == 100) {
			cm.dispose();
		}
	} else if (status == 2) {
		if (s == 0) {
			cm.sendNextPrev("#e<Maple Union คืออะไร?>#n\r\n\r\nตัวละครที่อยู่ใน #eMaple Union#n จะมี #bอันดับตัวละคร#k เพิ่มขึ้นตาม #rเลเวล#k\r\n\r\n#e<ตัวละครทั่วไป>#n\r\n#b#eB(60)>A(100)>S(140)>SS(200)>SSS(250)#n#k\r\n#e<Zero>#n\r\n#b#eB(130)>A(160)>S(180)>SS(200)>SSS(250)#n#k");
		} else if (s == 1) {
			cm.dispose();
		} else if (s == 2) {
			if (selection == 1) {
				cm.sendNext("#e<Novice Union>#n\r\n\r\n  -#e1 ขั้น#n #bLv.   -#k     #rเหรียญที่ต้องการ: ไม่มี#k     #bสมาชิกกองกำลัง: 9 คน#k#n\r\n  -#e2 ขั้น#n #bLv.1000#k   #rเหรียญที่ต้องการ: 120 เหรียญ#k   #bสมาชิกกองกำลัง: 10 คน#k\r\n  -#e3 ขั้น#n #bLv.1500#k   #rเหรียญที่ต้องการ: 140 เหรียญ#k   #bสมาชิกกองกำลัง: 11 คน#k\r\n  -#e4 ขั้น#n #bLv.2000#k   #rเหรียญที่ต้องการ: 150 เหรียญ#k   #bสมาชิกกองกำลัง: 12 คน#k\r\n  -#e5 ขั้น#n #bLv.2500#k   #rเหรียญที่ต้องการ: 160 เหรียญ#k   #bสมาชิกกองกำลัง: 13 คน#k");
			} else {
				cm.dispose();
			}
		} else if (s == 3) {
			cm.sendNextPrev("#e<กองกำลังและพลังรบ>#n\r\n\r\n#bพลังรบ#k ถูกกำหนดโดย #rเลเวล#k และ #rค่า Star Force#k ของตัวละคร\r\n\r\nโดยเฉพาะผลรวมพลังรบของ #bสมาชิกกองกำลัง#k เรียกว่า #bพลังรบของกองกำลัง#k ซึ่ง #bพลังรบของกองกำลัง#k ที่สูงจะทำให้สามารถสร้างดาเมจต่อศัตรูใน #rUnion Raid#k ได้มากขึ้น และรวบรวมเหรียญ Union ได้เร็วขึ้น");
		} else if (s == 4) {
			cm.sendNextPrev("#e<แผนที่การรบและบล็อกตัวละคร>#n\r\n\r\nเมื่อ #eลากและวาง#n ตัวละครบน #bแผนที่การรบ#k ตัวละครจะแสดงเป็น #bบล็อก#k และยึดครองส่วนหนึ่งของ #bแผนที่การรบ#k\r\n\r\n#eบล็อกตัวละคร#n จะมีรูปร่างที่แตกต่างกันตาม #bเลเวล#k และ #bประเภทอาชีพ#k โดยมี #bบล็อกตัวละครหลัก#k เป็นศูนย์กลาง");
		} else if (s == 5) {
			cm.sendNextPrev("#e<Union Raid>#n\r\n\r\nใน #bUnion Raid#k จะมี #bมอนสเตอร์ 2 ประเภท#k ปรากฏขึ้น\r\n\r\n#eประเภทแรก#n คือ #bมังกรยักษ์#k ที่อยู่ตรงกลางสนามรบ\r\n#bสมาชิกกองกำลัง#k จะโจมตีมังกรยักษ์ตรงกลางโดยอัตโนมัติ\r\n\r\n#rตัวละครที่เข้าร่วมการต่อสู้โดยตรง#k ก็สามารถโจมตี #bมังกรยักษ์#k ได้เช่นกัน\r\nแต่เมื่อ #bเกจสีเขียว#k ใน HP ของ #rมังกรยักษ์#k หมด จะมี #bโล่ป้องกัน#k เกิดขึ้น และการโจมตีของตัวละครที่เข้าร่วมโดยตรงจะไม่มีผล เหลือเพียง #bดาเมจของสมาชิกกองกำลังคนอื่นๆ เท่านั้น#k\r\n\r\nสมาชิกกองกำลังจะ #bดำเนินการต่อสู้#k กับมังกรยักษ์และรวบรวม #bเหรียญ Union#k ต่อไป #bแม้จะไม่ได้เข้าร่วมการต่อสู้โดยตรง#k\r\n\r\n#bเหรียญ Union#k จะ #rถูกคำนวณเมื่อออกจาก Raid#k ดังนั้น #bควรเข้ามาเป็นระยะๆ#k เพื่อรับเหรียญที่สมาชิกกองกำลังรวบรวมไว้");
		} else if (s == 6) {
			cm.sendNextPrev("#e<การจัดอันดับเหรียญที่ได้รับรายสัปดาห์>#n\r\n\r\nการจัดอันดับจะลงทะเบียนด้วย #bชื่อตัวละคร#k ที่อัปเดตเหรียญสะสมรายสัปดาห์ #bครั้งสุดท้าย#k และเมื่อถึงสัปดาห์ถัดไป #rUnion อันดับ 1 ถึง 100#k จะได้รับ #bของขวัญพิเศษ#k\r\nเหรียญที่ได้จาก #bเควสรายวัน#k ก็จะสะสมด้วย ดังนั้นควรเข้ามาบ่อยๆ ใช่ไหม?");
		} else if (s == 9) {
			cm.sendNextPrev("#e<ฟังก์ชันบันทึก Preset>#n\r\n\r\nPreset จะมีให้ 2 ตัวโดยพื้นฐาน และสามารถเพิ่มได้อีก #rสูงสุด 3 ตัว#k ผ่าน #b#i2436884:##t2436884##k ที่ขายใน #rCoin Shop#k\r\nซึ่งจะ #bเปิดใช้งานได้ 30 วัน#k");
		} else if (s == 100) {
			cm.dispose();
		}
	} else if (status == 3) {
		if (s == 0) {
			cm.dispose();
		} else if (s == 2) {
			cm.sendNextPrev("#e<Veteran Union>#n\r\n\r\n  -#e1 ขั้น#n #bLv.3000#k   #rเหรียญที่ต้องการ: 170 เหรียญ#k   #bสมาชิกกองกำลัง: 18 คน#k#n\r\n  -#e2 ขั้น#n #bLv.3500#k   #rเหรียญที่ต้องการ: 430 เหรียญ#k   #bสมาชิกกองกำลัง: 19 คน#k\r\n  -#e3 ขั้น#n #bLv.4000#k   #rเหรียญที่ต้องการ: 450 เหรียญ#k   #bสมาชิกกองกำลัง: 20 คน#k\r\n  -#e4 ขั้น#n #bLv.4500#k   #rเหรียญที่ต้องการ: 470 เหรียญ#k   #bสมาชิกกองกำลัง: 21 คน#k\r\n  -#e5 ขั้น#n #bLv.5000#k   #rเหรียญที่ต้องการ: 490 เหรียญ#k   #bสมาชิกกองกำลัง: 22 คน#k");
		} else if (s == 3) {
			cm.dispose();
		} else if (s == 4) {
			cm.sendNextPrev("#e<แผนที่การรบและบล็อกตัวละคร>#n\r\n\r\nเมื่อวางตัวละครบน #bแผนที่การรบ#k ครั้งแรก #rบล็อกตัวละครหลัก#k จะต้องอยู่ใน #bหนึ่งใน 4 ช่องตรงกลาง#k เสมอ\r\n\r\nหลังจากนั้นสามารถวางตัวละครตัวอื่นๆ โดยให้บล็อกตัวละครแตะกันหรือซ้อนกัน คุณสามารถ #bพลิกหรือหมุน#k บล็อกตัวละครเพื่อเปลี่ยนเป็นรูปร่างที่ต้องการ หรือ #bคลิกขวาเพื่อยกเลิก#k ได้");
		} else if (s == 5) {
			cm.sendNextPrev("#e<Union Raid>#n\r\n\r\n#eประเภทที่สอง#n คือ #bมังกรมินิ#k ที่คุ้มกันมังกรยักษ์\r\n\r\nพวกมันสามารถโจมตีได้เฉพาะ #rตัวละครที่เข้าร่วมการต่อสู้โดยตรง#k เท่านั้น และสามารถทำ #bเควสรายวัน#k โดยการกำจัดพวกมัน\r\nบางครั้งเมื่อกำจัดมังกรมินิ จะมี #bGolden Wyvern#k หายากปรากฏขึ้น");
		} else if (s == 6) {
			cm.dispose();
		} else if (s == 9) {
			cm.sendNextPrev("#e<ฟังก์ชันบันทึก Preset>#n\r\n\r\n#bคลิกปุ่ม Preset เพื่อวาง#k แล้วบันทึกไว้ หลังจากนั้นสามารถเปลี่ยนได้อย่างรวดเร็วผ่านการนำไปใช้! ถ้าเป็น Preset ที่กำลังใช้งานอยู่ เมื่อเปลี่ยนการวางและบันทึก จะถูกนำไปใช้ทันที");
		}
	} else if (status == 4) {
		if (s == 2) {
			cm.sendNextPrev("#e<Master Union>#n\r\n\r\n  -#e1 ขั้น#n #bLv.5500#k   #rเหรียญที่ต้องการ:  510 เหรียญ#k   #bสมาชิกกองกำลัง: 27 คน#k#n\r\n  -#e2 ขั้น#n #bLv.6000#k   #rเหรียญที่ต้องการ:  930 เหรียญ#k   #bสมาชิกกองกำลัง: 28 คน#k\r\n  -#e3 ขั้น#n #bLv.6500#k   #rเหรียญที่ต้องการ:  960 เหรียญ#k   #bสมาชิกกองกำลัง: 29 คน#k\r\n  -#e4 ขั้น#n #bLv.7000#k   #rเหรียญที่ต้องการ: 1000 เหรียญ#k   #bสมาชิกกองกำลัง: 30 คน#k\r\n  -#e5 ขั้น#n #bLv.7500#k   #rเหรียญที่ต้องการ: 1030 เหรียญ#k   #bสมาชิกกองกำลัง: 31 คน#k");
		} else if (s == 4) {
			cm.dispose();
		} else if (s == 5) {
			cm.sendNextPrev("#e<Union Raid>#n\r\n\r\n#bเหรียญ Union#k สามารถได้รับทีละ 1 เหรียญทุกครั้งที่ดาเมจสะสมต่อ #bมังกรยักษ์#k ถึง #e100 พันล้าน#n\r\nดาเมจสะสมจะ #bรีเซ็ตทุกวัน#k\r\n\r\nเหรียญ Union จะไม่สะสมอีกเมื่อถึง #rค่าจำกัด#k ที่แตกต่างกันตามแต่ละอันดับ Union ดังนั้นควรตรวจสอบทุกวันใช่ไหม?");
		} else if (s == 9) {
			cm.dispose();
		}
	} else if (status == 5) {
		if (s == 2) {
			cm.sendNextPrev("#e<Grand Master Union>#n\r\n\r\n  -#e1 ขั้น#n #bLv.8000#k   #rเหรียญที่ต้องการ: 1060 เหรียญ#k   #bสมาชิกกองกำลัง: 36 คน#k#n\r\n  -#e2 ขั้น#n #bLv.8500#k   #rเหรียญที่ต้องการ: 2200 เหรียญ#k   #bสมาชิกกองกำลัง: 37 คน#k\r\n  -#e3 ขั้น#n #bLv.9000#k   #rเหรียญที่ต้องการ: 2300 เหรียญ#k   #bสมาชิกกองกำลัง: 38 คน#k\r\n  -#e4 ขั้น#n #bLv.9500#k   #rเหรียญที่ต้องการ: 2350 เหรียญ#k   #bสมาชิกกองกำลัง: 39 คน#k\r\n  -#e5 ขั้น#n #bLv.10000#k  #rเหรียญที่ต้องการ: 2400 เหรียญ#k   #bสมาชิกกองกำลัง: 40 คน#k");
		} else if (s == 5) {
			cm.dispose();
		}
	} else if (status == 6) {
		if (s == 2) {
			cm.dispose();
		}
	}
}